0deg/sna/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00325;

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }
    outdoors
    {
        type            symmetryPlane;
    }
    floor
    {
	type		slip;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0.00325;
    }
    "fixedWalls.*"
    {
        type            kqRWallFunction;
        value           uniform 0.00325;
    }
}


// ************************************************************************* //
